{
    "01": "(error code: LUNA01) Import call arguments in LuNA do not match arguments in C++",
    "02": "(error code: LUNA02) No function with name $cf_name exists.\n- Called at:\n$callstack_entry- Function information:\n$cf",
    "03": "(error code: LUNA03) Multiple initializing of a DF $df_name.\n- DF information:\nDeclaration callstacks:\n$decl_callstacks\nInitialization callstacks:\n$defs_callstacks\nUse callstacks:\n$uses_callstacks",
    "04": "(error code: LUNA04) Call arguments do not match declared arguments.\n- Called at:\n$callstack_entry- Function information:\n$cf",
    "05": "(error code: LUNA05) Attempt to use uninitialized DF $df_name.\n- DF information:\nDeclaration callstacks:\n$decl_callstacks\nUse callstacks:\n$uses_callstacks",
    "06": "(error code: LUNA06) Wrong number of arguments when calling the function.",
    "07": "(error code: LUNA07) Multiple DF declarations in one block.\n- DF information:\nDeclaration callstacks:\n$decl_callstacks",
    "09": "(error code: LUNA09) Attempt to use DF after its deletion.",
    "10": "(error code: LUNA10) Unused DF $df_name.\n- DF information:\nDeclaration callstacks:\n$decl_callstacks\nInitialization callstacks:\n$defs_callstacks\nUse callstacks:\n$uses_callstacks",
    "11": "(error code: LUNA11) Importing multiple functions with same aliases.\n- Function information:\n$cf",
    "12": "(error code: LUNA12) No function named \"main\"",
    "13": "(error code: LUNA13) Identifiers with same names in one namespace.\n- DFs information:",
    "14": "(error code: LUNA14) Attempt to use undeclared DF $df_name.\nInitialization callstacks:\n$defs_callstacks\nUse callstacks:\n$uses_callstacks",
    "15": "(error code: LUNA15) Cyclic dependence.",
    "16": "(error code: LUNA16) Duplicate CF declaration of function $cf_name.\n- Function information:\n$cf",
    "17": "(error code: LUNA17) Attempt to import non-existing C++ function.\n- Function information:\n$cf",
    "23": "(error code: LUNA23) [WARNING] Expression inside \"if\" is constant $bool.\n- Called at:\n$callstack_entry",
    "24": "(error code: LUNA24) [WARNING] Expression inside \"if\" is always $bool in every execution path.\n- Called at:\n$callstack_entry",
    "25": "(error code: LUNA25) Return value of boolean operator is used as integer.",
    "26": "(error code: LUNA26) Attempt to initialize identifier that is not a DF.\n- Callstack:\n$callstack",
    "27": "(error code: LUNA27) Attempt to request uninitialized DF.",
    "28": "(error code: LUNA28) Attempt to use DF after exceeding requests limit.",
    "29": "(error code: LUNA29) Attempt to use DF after deleting it with the deletion operator",
    "30": "(error code: LUNA30) Attempt to use information dependence operator on structured CF",
    "31": "(error code: LUNA31) No \"nfparam\" value given.",
    "32": "(error code: LUNA32) Attempt to request DF from node where it is not present.",
    "33": "(error code: LUNA33) Unfitting parameter for \"nfparam\".",
    "34": "(error code: LUNA34) Unconditional recursion.",
    "35": "(error code: LUNA35) Initizalization loops index ranges' intersection.",
    "36": "(error code: LUNA36) Attempt to indexate an identifier that is not a DF.",
    "37": "(error code: LUNA37) No (guaranteed) initialization loop."
}